MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
/*
 * Loop function
 */
void app_loop(void) {
	// Process button events
	processSystemEvents();

	// Run the state machine
	runStateMachine();

	// Reset button states after processing
	stateMachine.outputBtnPressed = false;
	stateMachine.lockBtnPressed = false;
	stateMachine.voltageCurrentBtnPressed = false;
	stateMachine.rotaryBtnPressed = false;
	stateMachine.encoderTurnedFlag = false;
	stateMachine.stateTimeoutFlag = false;
	stateMachine.periodicCheckFlag = false;
	stateMachine.encoderTurnedFlag = false;
	stateMachine.awdgTriggeredFlag = false;
}

/*
 * Define Callbacks and ISR
 */
//BTN ISR to set event flags
void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin) {
    if (GPIO_Pin == SW1_TOGGLE_I_V_Pin) {
        systemEvents.voltageCurrentBtnEvent = true;
        EXTI->IMR1 &= ~(EXTI_IMR1_IM2);
    } else if (GPIO_Pin == SW2_DEBUG_BTN_Pin) {
        systemEvents.lockBtnEvent = true;
        EXTI->IMR1 &= ~(EXTI_IMR1_IM4);
        //lockButtonPressTime = HAL_GetTick();
    } else if (GPIO_Pin == SW3_OFF_ON_Pin) {
        systemEvents.outputBtnEvent = true;
        EXTI->IMR1 &= ~(EXTI_IMR1_IM1);
    } else if (GPIO_Pin == ENC_TOGGLE_UNITS_Pin) {
        systemEvents.rotaryBtnEvent = true;
        EXTI->IMR1 &= ~(EXTI_IMR1_IM8);
    }

    // Start debounce timer
    TIM7->ARR = 200;
    LL_TIM_SetCounter(TIM7, 0);
    LL_TIM_EnableCounter(TIM7);
}

//TIM capture callback
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim) {
    if (htim->Instance == TIM3) {
    	systemEvents.encoderTurnEvent = true;
    }
}

void TIM14_ISR(void) {
	if (LL_TIM_IsActiveFlag_UPDATE(TIM14)) {
		// Clear the update interrupt flag
		LL_TIM_ClearFlag_UPDATE(TIM14);

		// Handle periodic check for ACTIVE state
		systemEvents.periodicCheckEvent = true;
		//Reset CNT value
		LL_TIM_SetCounter(TIM14, 0);

		//Start timer again
		LL_TIM_EnableCounter(TIM14);
	}
}


void TIM15_ISR(void) {
	if (LL_TIM_IsActiveFlag_UPDATE(TIM15)) {
		// Clear the update interrupt flag
		LL_TIM_ClearFlag_UPDATE(TIM15);

		// Handle periodic check for ACTIVE state
		systemEvents.stateTimeoutEvent = true;
		//Reset CNT value
		//LL_TIM_DisableCounter(TIM15);  // Stop the timer after timeout

	}
}

/*
 * Define Process functions
 */
// Process button events in the main loop (Convert hardware events into logical events)
void processButtonEvents(void) {
    if (events->outputBtnEvent) {
    	//Reset btn event flag
        events->outputBtnEvent = false;
        sm->outputBtnPressed = true;
    } else if (events->voltageCurrentBtnEvent) {
    	events->voltageCurrentBtnEvent = false;
    	sm->voltageCurrentBtnPressed = true;
    } else if (events->lockBtnEvent) {
    	events->lockBtnEvent = false;
		sm->lockBtnPressed = true;

		//Toggle OCP mode
		switch(sm->OCPMode) {
			case OCP_DISABLED:
				sm->OCPMode = OCP_ENABLED;

				//Update AWD limits
				int isense_Vtrip_mV = (dhandle->currentSet *G_SENSE*R_SENSE_MOHMS)/1000; // mV  (mA * mOhms * Gain)
				int isense_rawADCtrip= (isense_Vtrip_mV *4095) / VDDA_APPLI; //value for AWD treshold
				Update_AWD_Thresholds(0, isense_rawADCtrip, ADC_ANALOGWATCHDOG_2);
				break;
			case OCP_ENABLED:
				sm->OCPMode = OCP_DISABLED;
				//Update AWD limits
				Update_AWD_Thresholds(0, OCP_DISABLED_HT, ADC_ANALOGWATCHDOG_2);

				//__HAL_ADC_DISABLE_IT(&hadc1, ADC_IT_AWD2); can be also used to write bit but
				//only when ADSTART bit is cleared to 0 (this ensures that no conversion is ongoing).
				break;
		}
    } else if (events->rotaryBtnEvent) {
    	//Reset btn event flag
    	events->rotaryBtnEvent = false;
		sm->rotaryBtnPressed = true;

    }
}

// Main system event processor that calls specialized handlers
void processSystemEvents(void) {
    // Process different event types using specialized functions
    processButtonEvents();

    if (events->encoderTurnEvent) {
    	sm->encoderTurnedFlag = true;
    	events->encoderTurnEvent = false;
    }
    if (events->stateTimeoutEvent) {
		sm->stateTimeoutFlag= true;
		events->stateTimeoutEvent = false;
	}
	if (events->periodicCheckEvent) {
		sm->periodicCheckFlag= true;
		events->periodicCheckEvent = false;
	}
    // Process AWDG events
    if (events->awdgEvent) {
        events->awdgEvent = false;
        sm->awdgTriggeredFlag = true;
    }
}

void handleCOMportstatus(uint8_t host_com_port_open){
	 static bool entryDone = false;
	 if (host_com_port_open == 1 && !entryDone) {
		 //Drive lock LED
		 HAL_GPIO_WritePin(LED_LOCK_GPIO_Port, LED_LOCK_Pin, GPIO_PIN_SET);

		 //Disable BTN interrupts
		 EXTI->IMR1 &= ~(EXTI_IMR1_IM2); //SW1
		 EXTI->IMR1 &= ~(EXTI_IMR1_IM4); //SW2
		 EXTI->IMR1 &= ~(EXTI_IMR1_IM1); //SW3
		 EXTI->IMR1 &= ~(EXTI_IMR1_IM8); //ENC btn

		 entryDone = true;
	 } else if (host_com_port_open == 0) {
		 HAL_GPIO_WritePin(LED_LOCK_GPIO_Port, LED_LOCK_Pin, GPIO_PIN_RESET);

		 //Unmask exti line 1, 2 and 3
		 EXTI->IMR1 |= EXTI_IMR1_IM8; //unmask exti line 8
		 EXTI->IMR1 |= EXTI_IMR1_IM4; //unmask exti line 4
		 EXTI->IMR1 |= EXTI_IMR1_IM2; //unmask exti line 2
		 EXTI->IMR1 |= EXTI_IMR1_IM1; //unmask exti line 1

		 entryDone = false;
	 }
}

void processUSBCommand(uint8_t* command, uint32_t length)
{
	// Null-terminate the command to ensure string functions work properly
	command[length] = '\0';

    if (strcmp((char*)command, "POWERON") == 0)
    {
        const char* response = "POWER is ON\r\n";
        CDC_Transmit_FS((uint8_t*)response, strlen(response));
    }
    else if (strcmp((char*)command, "POWEROFF") == 0)
    {
        const char* response = "POWER is OFF\r\n";
        CDC_Transmit_FS((uint8_t*)response, strlen(response));
    }
    else
    {
        const char* response = "Unknown command\r\n";
        CDC_Transmit_FS((uint8_t*)response, strlen(response));
    }
}
/*
 * Define state Handle functions
 */
void handleInitState(void) {
    // Entry actions (if just entered this state)
    static bool entryDone = false;

    //=======================================================
	// ENTRY ACTIONS - Executed once when entering the state
	//=======================================================
    if (!entryDone) {
    	// Set the state entry time and timeout duration
		sm->stateEntryTime = HAL_GetTick();
		sm->timeoutCounter = 2000;  // 2 seconds timeout

    	//Show SRC limits on displays
        //max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet, 4);
        //max7219_PrintIspecial(SEGMENT_1, dhandle->voltageSet, 3);


        // Save state for return from temporary states
        strcpy(sm->lastStateStr, "INIT");
        sm->lastState = STATE_INIT;

        entryDone = true;
    }

