MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
	//If required temp value is within limits, assign it to voltage else assign limits
	if (currentTemp > dhandle->currentMax) {
		dhandle->currentSet = dhandle->currentMax;

	} else if (currentTemp < dhandle->currentMin) {
		dhandle->currentSet = dhandle->currentMin;

	} else {
		dhandle->currentSet = currentTemp;
	}

	//Print selected voltage to disp, decimal at digit 3
	max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet, 4);
}

// Helper function to update voltage
void updateCurrentOCP(void) {
	//Get direction of encoder turning
	int currentTemp = dhandle->currentOCPSet;
	currentTemp += sm->encoder.direction * sm->encoder.increment;

	//If required temp value is within limits, assign it to voltage
	if ( (dhandle->currentMin <= currentTemp) && (currentTemp <= (dhandle->currentMax + 300)) ) {
		dhandle->currentOCPSet = currentTemp;
	} else {
		//currentOCPTemp = currentOCP;
	}

	int V_TRIP = (dhandle->currentOCPSet * R_OCP_MOHMS * G_OCP)/1000; // mV (mA * mOhms * Gain)
	//Convert DAC_OUT voltage to 12B resolution
	int dac_value = (V_TRIP *4095) / VDDA_APPLI;//__LL_ADC_DIGITAL_SCALE(LL_ADC_RESOLUTION_12B);
	//Write output with DAC..
	HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, dac_value);

	//Print selected voltage to disp, decimal at digit 3
	max7219_PrintIspecial(SEGMENT_2, dhandle->currentOCPSet, 4);
}

//Make voltage correction for the voltage drops on rshunts
uint32_t compensateVoltage(void) {
	uint32_t correction = (dhandle->currentSet * (R_OCP_MOHMS + R_SENSE_MOHMS) ) / 1000;
	uint32_t compVoltage = dhandle->voltageSet + correction;

	return (compVoltage > dhandle->voltageMax) ? dhandle->voltageMax : compVoltage;
}
